HELLO_MESSAGE = """
<b>SHIZU - это развлекательный бот для оживления фотографий и создания забавных гримас. С его помощью вы можете:</b>

▪️ Оживлять фотографии, добавляя движение и речь
▪️ Создавать смешные гримасы на ваших фото
▪️ Делиться результатами с друзьями

Попробуйте наши функции и дайте волю своему творчеству! Начните с выбора действия ниже. 👇
"""

ALIVE_PHOTO_WAIT_PIC_MESSAGE = "Для создания анимированного фото, пожалуйста, отправьте мне фотографию. 🖼"
ALIVE_PHOTO_WAIT_PIC_MESSAGE_RETRY = "Фото не найдено. Попробуйте еще раз. 🖼"
ALIVE_PHOTO_WAIT_VIDEO_MESSAGE_RETRY = "Видео не найдено. Попробуйте еще раз. 📹"
ALIVE_PHOTO_WAIT_VIDEO_MESSAGE = """
Отлично! Теперь отправьте мне видео с движениями и речью (до 30 секунд). 📹
Вы можете отправить видеосообщение (кружок) или любой видеофайл до 50 МБ.
Если длительность видео превышает 30 секунд, будут обработаны только первые 30 секунд.
"""
ALIVE_PHOTO_WORKING = """
Спасибо! Начинаю обработку вашего запроса. С вашего баланса списана 1 генерация.
Обработка может занять некоторое время. Пожалуйста, подождите... 🛠
"""
ALIVE_PHOTO_DONE = "Ваше анимированное фото готово! Вот результат. 🤗"

ALIVE_SHIZUFACE_WAIT_PIC_MESSAGE = "Для создания SHIZUFACE, пожалуйста, отправьте мне фотографию. 🖼"

BUTTON_ALIVE_PHOTO = "🎭 Оживить фото"
BUTTON_ALIVE_SHIZUFACE = "😜 SHIZUФЕЙС"
BUTTON_REFERRAL = "🎁 Реферальная программа"
BUTTON_BALANCE = "💰 Баланс и покупка генераций"
BUTTON_HELP = "ℹ️ Помощь"
BUTTON_HOME = "🏠 Главное меню"
BUTTON_BUY_GENS = "🛒 Купить генерации"
BUTTON_BUY_SUBS = "✨ Оформить подписку"
BUTTON_EARN_GENS = "🎁 Заработать генерации"